wroscoe/dustycam/cameras/esp32_s3_cam/software/camlogger/sdkconfig.defaults
# GOOUUU ESP32-S3-CAM: 16MB flash (DIO per stock bootloader), 8MB octal PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# OTA over plain HTTP on the LAN + rollback safety
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xc000

# OTA download from app_main overflows the 3.5KB default (learned 2026-08-09)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
